#
# if文： x > 0 のときに y を 1 にする、それ以外は y を 0 にするという手続
#
x <- 5

if (x > 0)  {

  y <- 1

} else {

  y <- 0

}

list("result = ", y)

#
# if文の構文
#
   
if (条件 1) {

    条件 1 が成立したときの手続き

} else if (条件 2) {

    条件 1 が不成立、条件 2 が成立したときの手続き
    
} else if (条件 3) {
  
    条件 2 までが不成立、条件 3 が成立したときの手続き
    
} else if ...
  :
} else {
  
   上記どの条件も成立しなかったときの手続き

}

##
## 課題 13-1: 入力が 0 のときに 1、それ以外では 0 を返す関数 d を定義し
## ましょう。

d <- function (x) {

  if ( x==0 ) {
    1
  } else {
    0
  }
}

d(0); d(1);  d(-2)

#
# while 文
# 
while (条件) {

    条件が成立しているとき、実行する手続き

}

#
# while文: 1 から 3 までが出力されます。
#
x <- 1
while (x <= 3) {
  print(x);
  x <- x + 1
}

##
## 課題 13-2:
##
##  while 文を使って、1,3,5,7,9,11 を1行ずつ表示しましょう。
##

n <- 1
while (n<13) {
  print(n)
  n <- n+2
}

#
# for 文の構文
#

   for (変数 in 要素群) {

     手続き

   }

#
# for: 1 から 5 までの二乗をベクトルにし ます。
# 
   x <- NULL
   for (i in 1:5) {
     x <- append(x, i**2)
   }
   x

##
## 課題 13-3:

### 課題 12-2 を for 文を使って書き直しましょう。

###   実は for 文を使わなくても、x <- (1:5)**2 で同じことができる。
###   x <- c(x, i**2)でも良い。c はベクトルの連結にも使うことができる。

(1:5)*2+1

seq(1,11,2)

for (i in seq(1,11,2)) {

  print(i)

}
